{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "ViltForQuestionAnswering",
    "parent_library": "transformers.models.vilt.modeling_vilt"
  },
  "base_model_name_or_path": "dandelin/vilt-b32-finetuned-vqa",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "value",
    "query"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}